of7/SbmBloodTubeFoam/tutorials/2DTubeBlood_Flow/0/c
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      c; // concentration
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.25;  // 25% bulk hematocrit

boundaryField
{
    inlet
    {
    type            fixedValue;
	value		uniform 0.25;
    }  
    walls
    {
	type            zeroGradient;       
    }
    outlet
    {
	type            slip;
    }
    wFront
    {
	type            wedge;     
    }
    wBack
    {
	type            wedge;     
    }
    axis
    {
	type            empty;     
    }
}

// ************************************************************************* //
